-- -- ALTER SEQUENCE team_id_seq RESTART WITH 7;

-- INSERT INTO team(name, players, reserve_players, type)
-- VALUES
--   ('메타 1학년 2반', '["김*환(04)", "김*(05)", "박*빈(07)", "임*훈(15)", "정*성(16)"]', '["강*우(01)", "안*태(11)"]', 'foot-volleyball'),
--   ('클보 1학년 2반', '["박*우(05)", "박*원(07)", "이*우(10)", "이*영(12)", "홍*희(18)"]', '["김*욱(04)", "박*(08)"]', 'foot-volleyball'),
--   ('메타 2학년 1반', '["김*완(01)", "오*환(05)", "유*현(08)", "이*훈(12)", "홍*범(17)"]', '["김*온(03)", "이*하(10)"]', 'foot-volleyball'),
--   ('클보 2학년 2반', '["신*호(07)", "윤*영(10)", "이*서(12)", "임*현(13)", "조*원(15)"]', '["박*영(06)", "신*민(08)"]', 'foot-volleyball'),
--   ('네보 3학년 1반', '["권*우(01)", "남*석(07)", "송*우(13)", "양*성(15)", "조*우(20)"]', '["김*진(04)", "원*연(15)"]', 'foot-volleyball'),
--   ('해킹 3학년 2반', '["김*서(04)", "박*희(07)", "이*경(12)", "이*주(13)", "조*준(17)"]', '["손*은(08)", "장*진(15)"]', 'foot-volleyball'),
  
--   ('메타 1학년 2반', '["김*환(04)", "김*(05)", "박*빈(07)", "임*훈(15)", "정*성(16)"]', '["강*우(01)", "안*태(11)"]', 'foot-volleyball'),
--   ('클보 1학년 2반', '["박*우(05)", "박*원(07)", "이*우(10)", "이*영(12)", "홍*희(18)"]', '["김*욱(04)", "박*(08)"]', 'foot-volleyball'),
--   ('메타 2학년 1반', '["김*완(01)", "오*환(05)", "유*현(08)", "이*훈(12)", "홍*범(17)"]', '["김*온(03)", "이*하(10)"]', 'foot-volleyball'),
--   ('클보 2학년 2반', '["신*호(07)", "윤*영(10)", "이*서(12)", "임*현(13)", "조*원(15)"]', '["박*영(06)", "신*민(08)"]', 'foot-volleyball'),
--   ('네보 3학년 1반', '["권*우(01)", "남*석(07)", "송*우(13)", "양*성(15)", "조*우(20)"]', '["김*진(04)", "원*연(15)"]', 'foot-volleyball'),
--   ('해킹 3학년 2반', '["김*서(04)", "박*희(07)", "이*경(12)", "이*주(13)", "조*준(17)"]', '["손*은(08)", "장*진(15)"]', 'foot-volleyball'),

--   ('클보 1학년 2반', '["권*현(01)", "김*성(03)", "김*욱(04)", "박*우(05)", "유*혁(09)", "이*진(11)", "이*영(12)", "정*원(14)", "추*강(17)", "홍*희(18)"]', '[]', 'dodge-ball'),
--   ('클보 1학년 1반', '["김*동(03)", "김*채(04)", "박*경(07)", "이*희(10)", "임*현(11)", "임*은(12)", "전*연(14)", "지*원(15)", "최*윤(17)", "최*호(18)"]', '[]', 'dodge-ball'),
--   ('네보 2학년 1반', '["강*민(01)", "김*유(04)", "김*경(05)", "김*성(06)", "박*훈(07)", "안*민(10)", "양*철(11)", "유*준(12)", "이*원(14)", "홍*성(16)"]', '[]', 'dodge-ball'),
--   ('클보 2학년 1반', '["김*균(02)", "김*준(04)", "김*빈(05)", "김*훈(06)", "박*윤(07)", "박*준(08)", "배*혜(10)", "신*희(11)", "엄*진(12)", "최*원(15)"]', '[]', 'dodge-ball'),
--   ('해킹 3학년 2반', '["권*찬(01)", "김*우(03)", "박*권(06)", "박*희(07)", "손*은(08)", "안*후(10)", "장*진(15)", "정*준(16)", "진*석(18)", "한*원(19)"]', '[]', 'dodge-ball'),
--   ('해킹 3학년 1반', '["김*건(02)", "김*정(03)", "김*랑(04)", "김*진(05)", "김*민(07)", "류*희(08)", "정*성(16)", "최*성(18)", "최*양(19)", "한*범(20)"]', '[]', 'dodge-ball')

-- -- INSERT INTO schedule(start_date, start_time, referee)
-- -- VALUES
-- --   ('2023-05-19', '9:00', '은석 T'),
-- --   ('2023-05-19', '9:15', '은석 T'),
-- --   ('2023-05-19', '9:30', '은석 T'),
-- --   ('2023-05-19', '10:00', '은석 T'),
-- --   ('2023-05-19', '10:20', '은석 T'),
-- --   ('2023-05-19', '10:40', '은석 T'),
-- --   ('2023-05-19', '11:10', '은석 T'),
-- --   ('2023-05-19', '11:20', '은석 T'),
-- --   ('2023-05-19', '11:30', '은석 T')

-- -- INSERT INTO team_schedule(team_id, schedule_id, type, score)
-- -- VALUES
-- --   (1, 1, 'basketball', '[]'),
-- --   (2, 1, 'basketball', '[]'),
-- --   (3, 2, 'basketball', '[]'),
-- --   (4, 2, 'basketball', '[]'),
-- --   (5, 3, 'basketball', '[]'),
-- --   (6, 3, 'basketball', '[]'),

-- --   (7, 4, 'foot-volleyball', '[]'),
-- --   (8, 4, 'foot-volleyball', '[]'),
-- --   (9, 5, 'foot-volleyball', '[]'),
-- --   (10, 5, 'foot-volleyball', '[]'),
-- --   (11, 6, 'foot-volleyball', '[]'),
-- --   (12, 6, 'foot-volleyball', '[]'),

-- --   (15, 7, 'dodge-ball', '[]'),
-- --   (16, 7, 'dodge-ball', '[]'),
-- --   (17, 8, 'dodge-ball', '[]'),
-- --   (18, 8, 'dodge-ball', '[]'),
-- --   (13, 9, 'dodge-ball', '[]'),
-- --   (14, 9, 'dodge-ball', '[]')